{"weightsManifest": [{"paths": ["group1-shard1of102.bin", "group1-shard2of102.bin", "group1-shard3of102.bin", "group1-shard4of102.bin", "group1-shard5of102.bin", "group1-shard6of102.bin", "group1-shard7of102.bin", "group1-shard8of102.bin", "group1-shard9of102.bin", "group1-shard10of102.bin", "group1-shard11of102.bin", "group1-shard12of102.bin", "group1-shard13of102.bin", "group1-shard14of102.bin", "group1-shard15of102.bin", "group1-shard16of102.bin", "group1-shard17of102.bin", "group1-shard18of102.bin", "group1-shard19of102.bin", "group1-shard20of102.bin", "group1-shard21of102.bin", "group1-shard22of102.bin", "group1-shard23of102.bin", "group1-shard24of102.bin", "group1-shard25of102.bin", "group1-shard26of102.bin", "group1-shard27of102.bin", "group1-shard28of102.bin", "group1-shard29of102.bin", "group1-shard30of102.bin", "group1-shard31of102.bin", "group1-shard32of102.bin", "group1-shard33of102.bin", "group1-shard34of102.bin", "group1-shard35of102.bin", "group1-shard36of102.bin", "group1-shard37of102.bin", "group1-shard38of102.bin", "group1-shard39of102.bin", "group1-shard40of102.bin", "group1-shard41of102.bin", "group1-shard42of102.bin", "group1-shard43of102.bin", "group1-shard44of102.bin", "group1-shard45of102.bin", "group1-shard46of102.bin", "group1-shard47of102.bin", "group1-shard48of102.bin", "group1-shard49of102.bin", "group1-shard50of102.bin", "group1-shard51of102.bin", "group1-shard52of102.bin", "group1-shard53of102.bin", "group1-shard54of102.bin", "group1-shard55of102.bin", "group1-shard56of102.bin", "group1-shard57of102.bin", "group1-shard58of102.bin", "group1-shard59of102.bin", "group1-shard60of102.bin", "group1-shard61of102.bin", "group1-shard62of102.bin", "group1-shard63of102.bin", "group1-shard64of102.bin", "group1-shard65of102.bin", "group1-shard66of102.bin", "group1-shard67of102.bin", "group1-shard68of102.bin", "group1-shard69of102.bin", "group1-shard70of102.bin", "group1-shard71of102.bin", "group1-shard72of102.bin", "group1-shard73of102.bin", "group1-shard74of102.bin", "group1-shard75of102.bin", "group1-shard76of102.bin", "group1-shard77of102.bin", "group1-shard78of102.bin", "group1-shard79of102.bin", "group1-shard80of102.bin", "group1-shard81of102.bin", "group1-shard82of102.bin", "group1-shard83of102.bin", "group1-shard84of102.bin", "group1-shard85of102.bin", "group1-shard86of102.bin", "group1-shard87of102.bin", "group1-shard88of102.bin", "group1-shard89of102.bin", "group1-shard90of102.bin", "group1-shard91of102.bin", "group1-shard92of102.bin", "group1-shard93of102.bin", "group1-shard94of102.bin", "group1-shard95of102.bin", "group1-shard96of102.bin", "group1-shard97of102.bin", "group1-shard98of102.bin", "group1-shard99of102.bin", "group1-shard100of102.bin", "group1-shard101of102.bin", "group1-shard102of102.bin"], "weights": [{"dtype": "float32", "shape": [165888, 512], "name": "dense_1/kernel"}, {"dtype": "float32", "shape": [512], "name": "dense_1/bias"}, {"dtype": "float32", "shape": [512, 256], "name": "dense_2/kernel"}, {"dtype": "float32", "shape": [256], "name": "dense_2/bias"}, {"dtype": "float32", "shape": [256, 64], "name": "dense_3/kernel"}, {"dtype": "float32", "shape": [64], "name": "dense_3/bias"}, {"dtype": "float32", "shape": [64, 9], "name": "dense_4/kernel"}, {"dtype": "float32", "shape": [9], "name": "dense_4/bias"}, {"dtype": "float32", "shape": [3, 3, 3, 32], "name": "conv2d_1/kernel"}, {"dtype": "float32", "shape": [32], "name": "batch_normalization_1/beta"}, {"dtype": "float32", "shape": [3, 3, 32, 32], "name": "conv2d_2/kernel"}, {"dtype": "float32", "shape": [32], "name": "batch_normalization_2/beta"}, {"dtype": "float32", "shape": [3, 3, 32, 64], "name": "conv2d_3/kernel"}, {"dtype": "float32", "shape": [64], "name": "batch_normalization_3/beta"}, {"dtype": "float32", "shape": [1, 1, 64, 80], "name": "conv2d_4/kernel"}, {"dtype": "float32", "shape": [80], "name": "batch_normalization_4/beta"}, {"dtype": "float32", "shape": [3, 3, 80, 192], "name": "conv2d_5/kernel"}, {"dtype": "float32", "shape": [192], "name": "batch_normalization_5/beta"}, {"dtype": "float32", "shape": [1, 1, 192, 64], "name": "conv2d_9/kernel"}, {"dtype": "float32", "shape": [64], "name": "batch_normalization_9/beta"}, {"dtype": "float32", "shape": [1, 1, 192, 48], "name": "conv2d_7/kernel"}, {"dtype": "float32", "shape": [3, 3, 64, 96], "name": "conv2d_10/kernel"}, {"dtype": "float32", "shape": [48], "name": "batch_normalization_7/beta"}, {"dtype": "float32", "shape": [96], "name": "batch_normalization_10/beta"}, {"dtype": "float32", "shape": [1, 1, 192, 64], "name": "conv2d_6/kernel"}, {"dtype": "float32", "shape": [5, 5, 48, 64], "name": "conv2d_8/kernel"}, {"dtype": "float32", "shape": [3, 3, 96, 96], "name": "conv2d_11/kernel"}, {"dtype": "float32", "shape": [1, 1, 192, 32], "name": "conv2d_12/kernel"}, {"dtype": "float32", "shape": [64], "name": "batch_normalization_6/beta"}, {"dtype": "float32", "shape": [64], "name": "batch_normalization_8/beta"}, {"dtype": "float32", "shape": [96], "name": "batch_normalization_11/beta"}, {"dtype": "float32", "shape": [32], "name": "batch_normalization_12/beta"}, {"dtype": "float32", "shape": [1, 1, 256, 64], "name": "conv2d_16/kernel"}, {"dtype": "float32", "shape": [64], "name": "batch_normalization_16/beta"}, {"dtype": "float32", "shape": [1, 1, 256, 48], "name": "conv2d_14/kernel"}, {"dtype": "float32", "shape": [3, 3, 64, 96], "name": "conv2d_17/kernel"}, {"dtype": "float32", "shape": [48], "name": "batch_normalization_14/beta"}, {"dtype": "float32", "shape": [96], "name": "batch_normalization_17/beta"}, {"dtype": "float32", "shape": [1, 1, 256, 64], "name": "conv2d_13/kernel"}, {"dtype": "float32", "shape": [5, 5, 48, 64], "name": "conv2d_15/kernel"}, {"dtype": "float32", "shape": [3, 3, 96, 96], "name": "conv2d_18/kernel"}, {"dtype": "float32", "shape": [1, 1, 256, 64], "name": "conv2d_19/kernel"}, {"dtype": "float32", "shape": [64], "name": "batch_normalization_13/beta"}, {"dtype": "float32", "shape": [64], "name": "batch_normalization_15/beta"}, {"dtype": "float32", "shape": [96], "name": "batch_normalization_18/beta"}, {"dtype": "float32", "shape": [64], "name": "batch_normalization_19/beta"}, {"dtype": "float32", "shape": [1, 1, 288, 64], "name": "conv2d_23/kernel"}, {"dtype": "float32", "shape": [64], "name": "batch_normalization_23/beta"}, {"dtype": "float32", "shape": [1, 1, 288, 48], "name": "conv2d_21/kernel"}, {"dtype": "float32", "shape": [3, 3, 64, 96], "name": "conv2d_24/kernel"}, {"dtype": "float32", "shape": [48], "name": "batch_normalization_21/beta"}, {"dtype": "float32", "shape": [96], "name": "batch_normalization_24/beta"}, {"dtype": "float32", "shape": [1, 1, 288, 64], "name": "conv2d_20/kernel"}, {"dtype": "float32", "shape": [5, 5, 48, 64], "name": "conv2d_22/kernel"}, {"dtype": "float32", "shape": [3, 3, 96, 96], "name": "conv2d_25/kernel"}, {"dtype": "float32", "shape": [1, 1, 288, 64], "name": "conv2d_26/kernel"}, {"dtype": "float32", "shape": [64], "name": "batch_normalization_20/beta"}, {"dtype": "float32", "shape": [64], "name": "batch_normalization_22/beta"}, {"dtype": "float32", "shape": [96], "name": "batch_normalization_25/beta"}, {"dtype": "float32", "shape": [64], "name": "batch_normalization_26/beta"}, {"dtype": "float32", "shape": [1, 1, 288, 64], "name": "conv2d_28/kernel"}, {"dtype": "float32", "shape": [64], "name": "batch_normalization_28/beta"}, {"dtype": "float32", "shape": [3, 3, 64, 96], "name": "conv2d_29/kernel"}, {"dtype": "float32", "shape": [96], "name": "batch_normalization_29/beta"}, {"dtype": "float32", "shape": [3, 3, 288, 384], "name": "conv2d_27/kernel"}, {"dtype": "float32", "shape": [3, 3, 96, 96], "name": "conv2d_30/kernel"}, {"dtype": "float32", "shape": [384], "name": "batch_normalization_27/beta"}, {"dtype": "float32", "shape": [96], "name": "batch_normalization_30/beta"}, {"dtype": "float32", "shape": [1, 1, 768, 128], "name": "conv2d_35/kernel"}, {"dtype": "float32", "shape": [128], "name": "batch_normalization_35/beta"}, {"dtype": "float32", "shape": [7, 1, 128, 128], "name": "conv2d_36/kernel"}, {"dtype": "float32", "shape": [128], "name": "batch_normalization_36/beta"}, {"dtype": "float32", "shape": [1, 1, 768, 128], "name": "conv2d_32/kernel"}, {"dtype": "float32", "shape": [1, 7, 128, 128], "name": "conv2d_37/kernel"}, {"dtype": "float32", "shape": [128], "name": "batch_normalization_32/beta"}, {"dtype": "float32", "shape": [128], "name": "batch_normalization_37/beta"}, {"dtype": "float32", "shape": [1, 7, 128, 128], "name": "conv2d_33/kernel"}, {"dtype": "float32", "shape": [7, 1, 128, 128], "name": "conv2d_38/kernel"}, {"dtype": "float32", "shape": [128], "name": "batch_normalization_33/beta"}, {"dtype": "float32", "shape": [128], "name": "batch_normalization_38/beta"}, {"dtype": "float32", "shape": [1, 1, 768, 192], "name": "conv2d_31/kernel"}, {"dtype": "float32", "shape": [7, 1, 128, 192], "name": "conv2d_34/kernel"}, {"dtype": "float32", "shape": [1, 7, 128, 192], "name": "conv2d_39/kernel"}, {"dtype": "float32", "shape": [1, 1, 768, 192], "name": "conv2d_40/kernel"}, {"dtype": "float32", "shape": [192], "name": "batch_normalization_31/beta"}, {"dtype": "float32", "shape": [192], "name": "batch_normalization_34/beta"}, {"dtype": "float32", "shape": [192], "name": "batch_normalization_39/beta"}, {"dtype": "float32", "shape": [192], "name": "batch_normalization_40/beta"}, {"dtype": "float32", "shape": [1, 1, 768, 160], "name": "conv2d_45/kernel"}, {"dtype": "float32", "shape": [160], "name": "batch_normalization_45/beta"}, {"dtype": "float32", "shape": [7, 1, 160, 160], "name": "conv2d_46/kernel"}, {"dtype": "float32", "shape": [160], "name": "batch_normalization_46/beta"}, {"dtype": "float32", "shape": [1, 1, 768, 160], "name": "conv2d_42/kernel"}, {"dtype": "float32", "shape": [1, 7, 160, 160], "name": "conv2d_47/kernel"}, {"dtype": "float32", "shape": [160], "name": "batch_normalization_42/beta"}, {"dtype": "float32", "shape": [160], "name": "batch_normalization_47/beta"}, {"dtype": "float32", "shape": [1, 7, 160, 160], "name": "conv2d_43/kernel"}, {"dtype": "float32", "shape": [7, 1, 160, 160], "name": "conv2d_48/kernel"}, {"dtype": "float32", "shape": [160], "name": "batch_normalization_43/beta"}, {"dtype": "float32", "shape": [160], "name": "batch_normalization_48/beta"}, {"dtype": "float32", "shape": [1, 1, 768, 192], "name": "conv2d_41/kernel"}, {"dtype": "float32", "shape": [7, 1, 160, 192], "name": "conv2d_44/kernel"}, {"dtype": "float32", "shape": [1, 7, 160, 192], "name": "conv2d_49/kernel"}, {"dtype": "float32", "shape": [1, 1, 768, 192], "name": "conv2d_50/kernel"}, {"dtype": "float32", "shape": [192], "name": "batch_normalization_41/beta"}, {"dtype": "float32", "shape": [192], "name": "batch_normalization_44/beta"}, {"dtype": "float32", "shape": [192], "name": "batch_normalization_49/beta"}, {"dtype": "float32", "shape": [192], "name": "batch_normalization_50/beta"}, {"dtype": "float32", "shape": [1, 1, 768, 160], "name": "conv2d_55/kernel"}, {"dtype": "float32", "shape": [160], "name": "batch_normalization_55/beta"}, {"dtype": "float32", "shape": [7, 1, 160, 160], "name": "conv2d_56/kernel"}, {"dtype": "float32", "shape": [160], "name": "batch_normalization_56/beta"}, {"dtype": "float32", "shape": [1, 1, 768, 160], "name": "conv2d_52/kernel"}, {"dtype": "float32", "shape": [1, 7, 160, 160], "name": "conv2d_57/kernel"}, {"dtype": "float32", "shape": [160], "name": "batch_normalization_52/beta"}, {"dtype": "float32", "shape": [160], "name": "batch_normalization_57/beta"}, {"dtype": "float32", "shape": [1, 7, 160, 160], "name": "conv2d_53/kernel"}, {"dtype": "float32", "shape": [7, 1, 160, 160], "name": "conv2d_58/kernel"}, {"dtype": "float32", "shape": [160], "name": "batch_normalization_53/beta"}, {"dtype": "float32", "shape": [160], "name": "batch_normalization_58/beta"}, {"dtype": "float32", "shape": [1, 1, 768, 192], "name": "conv2d_51/kernel"}, {"dtype": "float32", "shape": [7, 1, 160, 192], "name": "conv2d_54/kernel"}, {"dtype": "float32", "shape": [1, 7, 160, 192], "name": "conv2d_59/kernel"}, {"dtype": "float32", "shape": [1, 1, 768, 192], "name": "conv2d_60/kernel"}, {"dtype": "float32", "shape": [192], "name": "batch_normalization_51/beta"}, {"dtype": "float32", "shape": [192], "name": "batch_normalization_54/beta"}, {"dtype": "float32", "shape": [192], "name": "batch_normalization_59/beta"}, {"dtype": "float32", "shape": [192], "name": "batch_normalization_60/beta"}, {"dtype": "float32", "shape": [1, 1, 768, 192], "name": "conv2d_65/kernel"}, {"dtype": "float32", "shape": [192], "name": "batch_normalization_65/beta"}, {"dtype": "float32", "shape": [7, 1, 192, 192], "name": "conv2d_66/kernel"}, {"dtype": "float32", "shape": [192], "name": "batch_normalization_66/beta"}, {"dtype": "float32", "shape": [1, 1, 768, 192], "name": "conv2d_62/kernel"}, {"dtype": "float32", "shape": [1, 7, 192, 192], "name": "conv2d_67/kernel"}, {"dtype": "float32", "shape": [192], "name": "batch_normalization_62/beta"}, {"dtype": "float32", "shape": [192], "name": "batch_normalization_67/beta"}, {"dtype": "float32", "shape": [1, 7, 192, 192], "name": "conv2d_63/kernel"}, {"dtype": "float32", "shape": [7, 1, 192, 192], "name": "conv2d_68/kernel"}, {"dtype": "float32", "shape": [192], "name": "batch_normalization_63/beta"}, {"dtype": "float32", "shape": [192], "name": "batch_normalization_68/beta"}, {"dtype": "float32", "shape": [1, 1, 768, 192], "name": "conv2d_61/kernel"}, {"dtype": "float32", "shape": [7, 1, 192, 192], "name": "conv2d_64/kernel"}, {"dtype": "float32", "shape": [1, 7, 192, 192], "name": "conv2d_69/kernel"}, {"dtype": "float32", "shape": [1, 1, 768, 192], "name": "conv2d_70/kernel"}, {"dtype": "float32", "shape": [192], "name": "batch_normalization_61/beta"}, {"dtype": "float32", "shape": [192], "name": "batch_normalization_64/beta"}, {"dtype": "float32", "shape": [192], "name": "batch_normalization_69/beta"}, {"dtype": "float32", "shape": [192], "name": "batch_normalization_70/beta"}, {"dtype": "float32", "shape": [1, 1, 768, 192], "name": "conv2d_73/kernel"}, {"dtype": "float32", "shape": [192], "name": "batch_normalization_73/beta"}, {"dtype": "float32", "shape": [1, 7, 192, 192], "name": "conv2d_74/kernel"}, {"dtype": "float32", "shape": [192], "name": "batch_normalization_74/beta"}, {"dtype": "float32", "shape": [1, 1, 768, 192], "name": "conv2d_71/kernel"}, {"dtype": "float32", "shape": [7, 1, 192, 192], "name": "conv2d_75/kernel"}, {"dtype": "float32", "shape": [192], "name": "batch_normalization_71/beta"}, {"dtype": "float32", "shape": [192], "name": "batch_normalization_75/beta"}, {"dtype": "float32", "shape": [3, 3, 192, 320], "name": "conv2d_72/kernel"}, {"dtype": "float32", "shape": [3, 3, 192, 192], "name": "conv2d_76/kernel"}, {"dtype": "float32", "shape": [320], "name": "batch_normalization_72/beta"}, {"dtype": "float32", "shape": [192], "name": "batch_normalization_76/beta"}, {"dtype": "float32", "shape": [1, 1, 1280, 448], "name": "conv2d_81/kernel"}, {"dtype": "float32", "shape": [448], "name": "batch_normalization_81/beta"}, {"dtype": "float32", "shape": [1, 1, 1280, 384], "name": "conv2d_78/kernel"}, {"dtype": "float32", "shape": [3, 3, 448, 384], "name": "conv2d_82/kernel"}, {"dtype": "float32", "shape": [384], "name": "batch_normalization_78/beta"}, {"dtype": "float32", "shape": [384], "name": "batch_normalization_82/beta"}, {"dtype": "float32", "shape": [1, 3, 384, 384], "name": "conv2d_79/kernel"}, {"dtype": "float32", "shape": [3, 1, 384, 384], "name": "conv2d_80/kernel"}, {"dtype": "float32", "shape": [1, 3, 384, 384], "name": "conv2d_83/kernel"}, {"dtype": "float32", "shape": [3, 1, 384, 384], "name": "conv2d_84/kernel"}, {"dtype": "float32", "shape": [1, 1, 1280, 320], "name": "conv2d_77/kernel"}, {"dtype": "float32", "shape": [384], "name": "batch_normalization_79/beta"}, {"dtype": "float32", "shape": [384], "name": "batch_normalization_80/beta"}, {"dtype": "float32", "shape": [384], "name": "batch_normalization_83/beta"}, {"dtype": "float32", "shape": [384], "name": "batch_normalization_84/beta"}, {"dtype": "float32", "shape": [1, 1, 1280, 192], "name": "conv2d_85/kernel"}, {"dtype": "float32", "shape": [320], "name": "batch_normalization_77/beta"}, {"dtype": "float32", "shape": [192], "name": "batch_normalization_85/beta"}, {"dtype": "float32", "shape": [1, 1, 2048, 448], "name": "conv2d_90/kernel"}, {"dtype": "float32", "shape": [448], "name": "batch_normalization_90/beta"}, {"dtype": "float32", "shape": [1, 1, 2048, 384], "name": "conv2d_87/kernel"}, {"dtype": "float32", "shape": [3, 3, 448, 384], "name": "conv2d_91/kernel"}, {"dtype": "float32", "shape": [384], "name": "batch_normalization_87/beta"}, {"dtype": "float32", "shape": [384], "name": "batch_normalization_91/beta"}, {"dtype": "float32", "shape": [1, 3, 384, 384], "name": "conv2d_88/kernel"}, {"dtype": "float32", "shape": [3, 1, 384, 384], "name": "conv2d_89/kernel"}, {"dtype": "float32", "shape": [1, 3, 384, 384], "name": "conv2d_92/kernel"}, {"dtype": "float32", "shape": [3, 1, 384, 384], "name": "conv2d_93/kernel"}, {"dtype": "float32", "shape": [1, 1, 2048, 320], "name": "conv2d_86/kernel"}, {"dtype": "float32", "shape": [384], "name": "batch_normalization_88/beta"}, {"dtype": "float32", "shape": [384], "name": "batch_normalization_89/beta"}, {"dtype": "float32", "shape": [384], "name": "batch_normalization_92/beta"}, {"dtype": "float32", "shape": [384], "name": "batch_normalization_93/beta"}, {"dtype": "float32", "shape": [1, 1, 2048, 192], "name": "conv2d_94/kernel"}, {"dtype": "float32", "shape": [320], "name": "batch_normalization_86/beta"}, {"dtype": "float32", "shape": [192], "name": "batch_normalization_94/beta"}, {"dtype": "float32", "shape": [32], "name": "batch_normalization_1/moving_mean"}, {"dtype": "float32", "shape": [32], "name": "batch_normalization_1/moving_variance"}, {"dtype": "float32", "shape": [32], "name": "batch_normalization_2/moving_mean"}, {"dtype": "float32", "shape": [32], "name": "batch_normalization_2/moving_variance"}, {"dtype": "float32", "shape": [64], "name": "batch_normalization_3/moving_mean"}, {"dtype": "float32", "shape": [64], "name": "batch_normalization_3/moving_variance"}, {"dtype": "float32", "shape": [80], "name": "batch_normalization_4/moving_mean"}, {"dtype": "float32", "shape": [80], "name": "batch_normalization_4/moving_variance"}, {"dtype": "float32", "shape": [192], "name": "batch_normalization_5/moving_mean"}, {"dtype": "float32", "shape": [192], "name": "batch_normalization_5/moving_variance"}, {"dtype": "float32", "shape": [64], "name": "batch_normalization_9/moving_mean"}, {"dtype": "float32", "shape": [64], "name": "batch_normalization_9/moving_variance"}, {"dtype": "float32", "shape": [48], "name": "batch_normalization_7/moving_mean"}, {"dtype": "float32", "shape": [48], "name": "batch_normalization_7/moving_variance"}, {"dtype": "float32", "shape": [96], "name": "batch_normalization_10/moving_mean"}, {"dtype": "float32", "shape": [96], "name": "batch_normalization_10/moving_variance"}, {"dtype": "float32", "shape": [64], "name": "batch_normalization_6/moving_mean"}, {"dtype": "float32", "shape": [64], "name": "batch_normalization_6/moving_variance"}, {"dtype": "float32", "shape": [64], "name": "batch_normalization_8/moving_mean"}, {"dtype": "float32", "shape": [64], "name": "batch_normalization_8/moving_variance"}, {"dtype": "float32", "shape": [96], "name": "batch_normalization_11/moving_mean"}, {"dtype": "float32", "shape": [96], "name": "batch_normalization_11/moving_variance"}, {"dtype": "float32", "shape": [32], "name": "batch_normalization_12/moving_mean"}, {"dtype": "float32", "shape": [32], "name": "batch_normalization_12/moving_variance"}, {"dtype": "float32", "shape": [64], "name": "batch_normalization_16/moving_mean"}, {"dtype": "float32", "shape": [64], "name": "batch_normalization_16/moving_variance"}, {"dtype": "float32", "shape": [48], "name": "batch_normalization_14/moving_mean"}, {"dtype": "float32", "shape": [48], "name": "batch_normalization_14/moving_variance"}, {"dtype": "float32", "shape": [96], "name": "batch_normalization_17/moving_mean"}, {"dtype": "float32", "shape": [96], "name": "batch_normalization_17/moving_variance"}, {"dtype": "float32", "shape": [64], "name": "batch_normalization_13/moving_mean"}, {"dtype": "float32", "shape": [64], "name": "batch_normalization_13/moving_variance"}, {"dtype": "float32", "shape": [64], "name": "batch_normalization_15/moving_mean"}, {"dtype": "float32", "shape": [64], "name": "batch_normalization_15/moving_variance"}, {"dtype": "float32", "shape": [96], "name": "batch_normalization_18/moving_mean"}, {"dtype": "float32", "shape": [96], "name": "batch_normalization_18/moving_variance"}, {"dtype": "float32", "shape": [64], "name": "batch_normalization_19/moving_mean"}, {"dtype": "float32", "shape": [64], "name": "batch_normalization_19/moving_variance"}, {"dtype": "float32", "shape": [64], "name": "batch_normalization_23/moving_mean"}, {"dtype": "float32", "shape": [64], "name": "batch_normalization_23/moving_variance"}, {"dtype": "float32", "shape": [48], "name": "batch_normalization_21/moving_mean"}, {"dtype": "float32", "shape": [48], "name": "batch_normalization_21/moving_variance"}, {"dtype": "float32", "shape": [96], "name": "batch_normalization_24/moving_mean"}, {"dtype": "float32", "shape": [96], "name": "batch_normalization_24/moving_variance"}, {"dtype": "float32", "shape": [64], "name": "batch_normalization_20/moving_mean"}, {"dtype": "float32", "shape": [64], "name": "batch_normalization_20/moving_variance"}, {"dtype": "float32", "shape": [64], "name": "batch_normalization_22/moving_mean"}, {"dtype": "float32", "shape": [64], "name": "batch_normalization_22/moving_variance"}, {"dtype": "float32", "shape": [96], "name": "batch_normalization_25/moving_mean"}, {"dtype": "float32", "shape": [96], "name": "batch_normalization_25/moving_variance"}, {"dtype": "float32", "shape": [64], "name": "batch_normalization_26/moving_mean"}, {"dtype": "float32", "shape": [64], "name": "batch_normalization_26/moving_variance"}, {"dtype": "float32", "shape": [64], "name": "batch_normalization_28/moving_mean"}, {"dtype": "float32", "shape": [64], "name": "batch_normalization_28/moving_variance"}, {"dtype": "float32", "shape": [96], "name": "batch_normalization_29/moving_mean"}, {"dtype": "float32", "shape": [96], "name": "batch_normalization_29/moving_variance"}, {"dtype": "float32", "shape": [384], "name": "batch_normalization_27/moving_mean"}, {"dtype": "float32", "shape": [384], "name": "batch_normalization_27/moving_variance"}, {"dtype": "float32", "shape": [96], "name": "batch_normalization_30/moving_mean"}, {"dtype": "float32", "shape": [96], "name": "batch_normalization_30/moving_variance"}, {"dtype": "float32", "shape": [128], "name": "batch_normalization_35/moving_mean"}, {"dtype": "float32", "shape": [128], "name": "batch_normalization_35/moving_variance"}, {"dtype": "float32", "shape": [128], "name": "batch_normalization_36/moving_mean"}, {"dtype": "float32", "shape": [128], "name": "batch_normalization_36/moving_variance"}, {"dtype": "float32", "shape": [128], "name": "batch_normalization_32/moving_mean"}, {"dtype": "float32", "shape": [128], "name": "batch_normalization_32/moving_variance"}, {"dtype": "float32", "shape": [128], "name": "batch_normalization_37/moving_mean"}, {"dtype": "float32", "shape": [128], "name": "batch_normalization_37/moving_variance"}, {"dtype": "float32", "shape": [128], "name": "batch_normalization_33/moving_mean"}, {"dtype": "float32", "shape": [128], "name": "batch_normalization_33/moving_variance"}, {"dtype": "float32", "shape": [128], "name": "batch_normalization_38/moving_mean"}, {"dtype": "float32", "shape": [128], "name": "batch_normalization_38/moving_variance"}, {"dtype": "float32", "shape": [192], "name": "batch_normalization_31/moving_mean"}, {"dtype": "float32", "shape": [192], "name": "batch_normalization_31/moving_variance"}, {"dtype": "float32", "shape": [192], "name": "batch_normalization_34/moving_mean"}, {"dtype": "float32", "shape": [192], "name": "batch_normalization_34/moving_variance"}, {"dtype": "float32", "shape": [192], "name": "batch_normalization_39/moving_mean"}, {"dtype": "float32", "shape": [192], "name": "batch_normalization_39/moving_variance"}, {"dtype": "float32", "shape": [192], "name": "batch_normalization_40/moving_mean"}, {"dtype": "float32", "shape": [192], "name": "batch_normalization_40/moving_variance"}, {"dtype": "float32", "shape": [160], "name": "batch_normalization_45/moving_mean"}, {"dtype": "float32", "shape": [160], "name": "batch_normalization_45/moving_variance"}, {"dtype": "float32", "shape": [160], "name": "batch_normalization_46/moving_mean"}, {"dtype": "float32", "shape": [160], "name": "batch_normalization_46/moving_variance"}, {"dtype": "float32", "shape": [160], "name": "batch_normalization_42/moving_mean"}, {"dtype": "float32", "shape": [160], "name": "batch_normalization_42/moving_variance"}, {"dtype": "float32", "shape": [160], "name": "batch_normalization_47/moving_mean"}, {"dtype": "float32", "shape": [160], "name": "batch_normalization_47/moving_variance"}, {"dtype": "float32", "shape": [160], "name": "batch_normalization_43/moving_mean"}, {"dtype": "float32", "shape": [160], "name": "batch_normalization_43/moving_variance"}, {"dtype": "float32", "shape": [160], "name": "batch_normalization_48/moving_mean"}, {"dtype": "float32", "shape": [160], "name": "batch_normalization_48/moving_variance"}, {"dtype": "float32", "shape": [192], "name": "batch_normalization_41/moving_mean"}, {"dtype": "float32", "shape": [192], "name": "batch_normalization_41/moving_variance"}, {"dtype": "float32", "shape": [192], "name": "batch_normalization_44/moving_mean"}, {"dtype": "float32", "shape": [192], "name": "batch_normalization_44/moving_variance"}, {"dtype": "float32", "shape": [192], "name": "batch_normalization_49/moving_mean"}, {"dtype": "float32", "shape": [192], "name": "batch_normalization_49/moving_variance"}, {"dtype": "float32", "shape": [192], "name": "batch_normalization_50/moving_mean"}, {"dtype": "float32", "shape": [192], "name": "batch_normalization_50/moving_variance"}, {"dtype": "float32", "shape": [160], "name": "batch_normalization_55/moving_mean"}, {"dtype": "float32", "shape": [160], "name": "batch_normalization_55/moving_variance"}, {"dtype": "float32", "shape": [160], "name": "batch_normalization_56/moving_mean"}, {"dtype": "float32", "shape": [160], "name": "batch_normalization_56/moving_variance"}, {"dtype": "float32", "shape": [160], "name": "batch_normalization_52/moving_mean"}, {"dtype": "float32", "shape": [160], "name": "batch_normalization_52/moving_variance"}, {"dtype": "float32", "shape": [160], "name": "batch_normalization_57/moving_mean"}, {"dtype": "float32", "shape": [160], "name": "batch_normalization_57/moving_variance"}, {"dtype": "float32", "shape": [160], "name": "batch_normalization_53/moving_mean"}, {"dtype": "float32", "shape": [160], "name": "batch_normalization_53/moving_variance"}, {"dtype": "float32", "shape": [160], "name": "batch_normalization_58/moving_mean"}, {"dtype": "float32", "shape": [160], "name": "batch_normalization_58/moving_variance"}, {"dtype": "float32", "shape": [192], "name": "batch_normalization_51/moving_mean"}, {"dtype": "float32", "shape": [192], "name": "batch_normalization_51/moving_variance"}, {"dtype": "float32", "shape": [192], "name": "batch_normalization_54/moving_mean"}, {"dtype": "float32", "shape": [192], "name": "batch_normalization_54/moving_variance"}, {"dtype": "float32", "shape": [192], "name": "batch_normalization_59/moving_mean"}, {"dtype": "float32", "shape": [192], "name": "batch_normalization_59/moving_variance"}, {"dtype": "float32", "shape": [192], "name": "batch_normalization_60/moving_mean"}, {"dtype": "float32", "shape": [192], "name": "batch_normalization_60/moving_variance"}, {"dtype": "float32", "shape": [192], "name": "batch_normalization_65/moving_mean"}, {"dtype": "float32", "shape": [192], "name": "batch_normalization_65/moving_variance"}, {"dtype": "float32", "shape": [192], "name": "batch_normalization_66/moving_mean"}, {"dtype": "float32", "shape": [192], "name": "batch_normalization_66/moving_variance"}, {"dtype": "float32", "shape": [192], "name": "batch_normalization_62/moving_mean"}, {"dtype": "float32", "shape": [192], "name": "batch_normalization_62/moving_variance"}, {"dtype": "float32", "shape": [192], "name": "batch_normalization_67/moving_mean"}, {"dtype": "float32", "shape": [192], "name": "batch_normalization_67/moving_variance"}, {"dtype": "float32", "shape": [192], "name": "batch_normalization_63/moving_mean"}, {"dtype": "float32", "shape": [192], "name": "batch_normalization_63/moving_variance"}, {"dtype": "float32", "shape": [192], "name": "batch_normalization_68/moving_mean"}, {"dtype": "float32", "shape": [192], "name": "batch_normalization_68/moving_variance"}, {"dtype": "float32", "shape": [192], "name": "batch_normalization_61/moving_mean"}, {"dtype": "float32", "shape": [192], "name": "batch_normalization_61/moving_variance"}, {"dtype": "float32", "shape": [192], "name": "batch_normalization_64/moving_mean"}, {"dtype": "float32", "shape": [192], "name": "batch_normalization_64/moving_variance"}, {"dtype": "float32", "shape": [192], "name": "batch_normalization_69/moving_mean"}, {"dtype": "float32", "shape": [192], "name": "batch_normalization_69/moving_variance"}, {"dtype": "float32", "shape": [192], "name": "batch_normalization_70/moving_mean"}, {"dtype": "float32", "shape": [192], "name": "batch_normalization_70/moving_variance"}, {"dtype": "float32", "shape": [192], "name": "batch_normalization_73/moving_mean"}, {"dtype": "float32", "shape": [192], "name": "batch_normalization_73/moving_variance"}, {"dtype": "float32", "shape": [192], "name": "batch_normalization_74/moving_mean"}, {"dtype": "float32", "shape": [192], "name": "batch_normalization_74/moving_variance"}, {"dtype": "float32", "shape": [192], "name": "batch_normalization_71/moving_mean"}, {"dtype": "float32", "shape": [192], "name": "batch_normalization_71/moving_variance"}, {"dtype": "float32", "shape": [192], "name": "batch_normalization_75/moving_mean"}, {"dtype": "float32", "shape": [192], "name": "batch_normalization_75/moving_variance"}, {"dtype": "float32", "shape": [320], "name": "batch_normalization_72/moving_mean"}, {"dtype": "float32", "shape": [320], "name": "batch_normalization_72/moving_variance"}, {"dtype": "float32", "shape": [192], "name": "batch_normalization_76/moving_mean"}, {"dtype": "float32", "shape": [192], "name": "batch_normalization_76/moving_variance"}, {"dtype": "float32", "shape": [448], "name": "batch_normalization_81/moving_mean"}, {"dtype": "float32", "shape": [448], "name": "batch_normalization_81/moving_variance"}, {"dtype": "float32", "shape": [384], "name": "batch_normalization_78/moving_mean"}, {"dtype": "float32", "shape": [384], "name": "batch_normalization_78/moving_variance"}, {"dtype": "float32", "shape": [384], "name": "batch_normalization_82/moving_mean"}, {"dtype": "float32", "shape": [384], "name": "batch_normalization_82/moving_variance"}, {"dtype": "float32", "shape": [384], "name": "batch_normalization_79/moving_mean"}, {"dtype": "float32", "shape": [384], "name": "batch_normalization_79/moving_variance"}, {"dtype": "float32", "shape": [384], "name": "batch_normalization_80/moving_mean"}, {"dtype": "float32", "shape": [384], "name": "batch_normalization_80/moving_variance"}, {"dtype": "float32", "shape": [384], "name": "batch_normalization_83/moving_mean"}, {"dtype": "float32", "shape": [384], "name": "batch_normalization_83/moving_variance"}, {"dtype": "float32", "shape": [384], "name": "batch_normalization_84/moving_mean"}, {"dtype": "float32", "shape": [384], "name": "batch_normalization_84/moving_variance"}, {"dtype": "float32", "shape": [320], "name": "batch_normalization_77/moving_mean"}, {"dtype": "float32", "shape": [320], "name": "batch_normalization_77/moving_variance"}, {"dtype": "float32", "shape": [192], "name": "batch_normalization_85/moving_mean"}, {"dtype": "float32", "shape": [192], "name": "batch_normalization_85/moving_variance"}, {"dtype": "float32", "shape": [448], "name": "batch_normalization_90/moving_mean"}, {"dtype": "float32", "shape": [448], "name": "batch_normalization_90/moving_variance"}, {"dtype": "float32", "shape": [384], "name": "batch_normalization_87/moving_mean"}, {"dtype": "float32", "shape": [384], "name": "batch_normalization_87/moving_variance"}, {"dtype": "float32", "shape": [384], "name": "batch_normalization_91/moving_mean"}, {"dtype": "float32", "shape": [384], "name": "batch_normalization_91/moving_variance"}, {"dtype": "float32", "shape": [384], "name": "batch_normalization_88/moving_mean"}, {"dtype": "float32", "shape": [384], "name": "batch_normalization_88/moving_variance"}, {"dtype": "float32", "shape": [384], "name": "batch_normalization_89/moving_mean"}, {"dtype": "float32", "shape": [384], "name": "batch_normalization_89/moving_variance"}, {"dtype": "float32", "shape": [384], "name": "batch_normalization_92/moving_mean"}, {"dtype": "float32", "shape": [384], "name": "batch_normalization_92/moving_variance"}, {"dtype": "float32", "shape": [384], "name": "batch_normalization_93/moving_mean"}, {"dtype": "float32", "shape": [384], "name": "batch_normalization_93/moving_variance"}, {"dtype": "float32", "shape": [320], "name": "batch_normalization_86/moving_mean"}, {"dtype": "float32", "shape": [320], "name": "batch_normalization_86/moving_variance"}, {"dtype": "float32", "shape": [192], "name": "batch_normalization_94/moving_mean"}, {"dtype": "float32", "shape": [192], "name": "batch_normalization_94/moving_variance"}]}], "modelTopology": {"training_config": {"loss": "categorical_crossentropy", "loss_weights": null, "metrics": ["accuracy"], "optimizer_config": {"class_name": "Adam", "config": {"beta_1": 0.8999999761581421, "beta_2": 0.9990000128746033, "decay": 0.0, "epsilon": 1e-07, "amsgrad": false, "lr": 9.999999747378752e-05}}, "weighted_metrics": null, "sample_weight_mode": null}, "keras_version": "2.2.5", "model_config": {"class_name": "Sequential", "config": {"layers": [{"class_name": "Model", "config": {"layers": [{"class_name": "InputLayer", "inbound_nodes": [], "config": {"dtype": "float32", "batch_input_shape": [null, 331, 331, 3], "name": "input_1", "sparse": false}, "name": "input_1"}, {"class_name": "Conv2D", "inbound_nodes": [[["input_1", 0, 0, {}]]], "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_1", "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "valid", "strides": [2, 2], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [3, 3]}, "name": "conv2d_1"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_1", 0, 0, {}]]], "config": {"beta_constraint": null, "scale": false, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_1", "gamma_regularizer": null, "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "dtype": "float32", "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "momentum": 0.99, "axis": 3}, "name": "batch_normalization_1"}, {"class_name": "Activation", "inbound_nodes": [[["batch_normalization_1", 0, 0, {}]]], "config": {"dtype": "float32", "activation": "relu", "trainable": true, "name": "activation_1"}, "name": "activation_1"}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_1", 0, 0, {}]]], "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_2", "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "valid", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [3, 3]}, "name": "conv2d_2"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_2", 0, 0, {}]]], "config": {"beta_constraint": null, "scale": false, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_2", "gamma_regularizer": null, "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "dtype": "float32", "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "momentum": 0.99, "axis": 3}, "name": "batch_normalization_2"}, {"class_name": "Activation", "inbound_nodes": [[["batch_normalization_2", 0, 0, {}]]], "config": {"dtype": "float32", "activation": "relu", "trainable": true, "name": "activation_2"}, "name": "activation_2"}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_2", 0, 0, {}]]], "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_3", "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [3, 3]}, "name": "conv2d_3"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_3", 0, 0, {}]]], "config": {"beta_constraint": null, "scale": false, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_3", "gamma_regularizer": null, "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "dtype": "float32", "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "momentum": 0.99, "axis": 3}, "name": "batch_normalization_3"}, {"class_name": "Activation", "inbound_nodes": [[["batch_normalization_3", 0, 0, {}]]], "config": {"dtype": "float32", "activation": "relu", "trainable": true, "name": "activation_3"}, "name": "activation_3"}, {"class_name": "MaxPooling2D", "inbound_nodes": [[["activation_3", 0, 0, {}]]], "config": {"name": "max_pooling2d_1", "dtype": "float32", "trainable": true, "data_format": "channels_last", "pool_size": [3, 3], "padding": "valid", "strides": [2, 2]}, "name": "max_pooling2d_1"}, {"class_name": "Conv2D", "inbound_nodes": [[["max_pooling2d_1", 0, 0, {}]]], "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_4", "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "valid", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 80, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [1, 1]}, "name": "conv2d_4"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_4", 0, 0, {}]]], "config": {"beta_constraint": null, "scale": false, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_4", "gamma_regularizer": null, "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "dtype": "float32", "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "momentum": 0.99, "axis": 3}, "name": "batch_normalization_4"}, {"class_name": "Activation", "inbound_nodes": [[["batch_normalization_4", 0, 0, {}]]], "config": {"dtype": "float32", "activation": "relu", "trainable": true, "name": "activation_4"}, "name": "activation_4"}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_4", 0, 0, {}]]], "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_5", "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "valid", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 192, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [3, 3]}, "name": "conv2d_5"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_5", 0, 0, {}]]], "config": {"beta_constraint": null, "scale": false, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_5", "gamma_regularizer": null, "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "dtype": "float32", "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "momentum": 0.99, "axis": 3}, "name": "batch_normalization_5"}, {"class_name": "Activation", "inbound_nodes": [[["batch_normalization_5", 0, 0, {}]]], "config": {"dtype": "float32", "activation": "relu", "trainable": true, "name": "activation_5"}, "name": "activation_5"}, {"class_name": "MaxPooling2D", "inbound_nodes": [[["activation_5", 0, 0, {}]]], "config": {"name": "max_pooling2d_2", "dtype": "float32", "trainable": true, "data_format": "channels_last", "pool_size": [3, 3], "padding": "valid", "strides": [2, 2]}, "name": "max_pooling2d_2"}, {"class_name": "Conv2D", "inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]], "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_9", "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [1, 1]}, "name": "conv2d_9"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_9", 0, 0, {}]]], "config": {"beta_constraint": null, "scale": false, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_9", "gamma_regularizer": null, "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "dtype": "float32", "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "momentum": 0.99, "axis": 3}, "name": "batch_normalization_9"}, {"class_name": "Activation", "inbound_nodes": [[["batch_normalization_9", 0, 0, {}]]], "config": {"dtype": "float32", "activation": "relu", "trainable": true, "name": "activation_9"}, "name": "activation_9"}, {"class_name": "Conv2D", "inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]], "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_7", "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 48, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [1, 1]}, "name": "conv2d_7"}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_9", 0, 0, {}]]], "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_10", "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 96, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [3, 3]}, "name": "conv2d_10"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_7", 0, 0, {}]]], "config": {"beta_constraint": null, "scale": false, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_7", "gamma_regularizer": null, "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "dtype": "float32", "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "momentum": 0.99, "axis": 3}, "name": "batch_normalization_7"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_10", 0, 0, {}]]], "config": {"beta_constraint": null, "scale": false, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_10", "gamma_regularizer": null, "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "dtype": "float32", "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "momentum": 0.99, "axis": 3}, "name": "batch_normalization_10"}, {"class_name": "Activation", "inbound_nodes": [[["batch_normalization_7", 0, 0, {}]]], "config": {"dtype": "float32", "activation": "relu", "trainable": true, "name": "activation_7"}, "name": "activation_7"}, {"class_name": "Activation", "inbound_nodes": [[["batch_normalization_10", 0, 0, {}]]], "config": {"dtype": "float32", "activation": "relu", "trainable": true, "name": "activation_10"}, "name": "activation_10"}, {"class_name": "AveragePooling2D", "inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]], "config": {"name": "average_pooling2d_1", "dtype": "float32", "trainable": true, "data_format": "channels_last", "pool_size": [3, 3], "padding": "same", "strides": [1, 1]}, "name": "average_pooling2d_1"}, {"class_name": "Conv2D", "inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]], "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_6", "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [1, 1]}, "name": "conv2d_6"}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_7", 0, 0, {}]]], "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_8", "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [5, 5]}, "name": "conv2d_8"}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_10", 0, 0, {}]]], "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_11", "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 96, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [3, 3]}, "name": "conv2d_11"}, {"class_name": "Conv2D", "inbound_nodes": [[["average_pooling2d_1", 0, 0, {}]]], "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_12", "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": true,